Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3bfd3d31be70675586cc59486f2c3f46277143880509ac880bbf7658550ccdff.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3bfd3d31be70675586cc59486f2c3f46277143880509ac880bbf7658550ccdff.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4823937720563912551" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/37f1cfb3c1de832c9e5be7f3e513954365dad5dca7d946380589dec3497b7fcf.zip" -> "builds/3bfd3d31be70675586cc59486f2c3f46277143880509ac880bbf7658550ccdff.zip"
          ~ "timestamp" = "1758788891312129000" -> "1759226141344896000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8927235780595205339" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788892332451200" -> "1759226141452227200"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9129303974709227401" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788904635155000" -> "1759226155173257200"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1634316680206886390" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788904629558000" -> "1759226154905122000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/3dde391dcb8f6dd3233c3c72c42593392a8985172785056fb6d57613535ceeac.zip" -> "builds/eb329e6e97a1e8d606d62dd5a81901b6dc0402915ef6de9963bd361817bb8992.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-09-25T08:31:46.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/eb329e6e97a1e8d606d62dd5a81901b6dc0402915ef6de9963bd361817bb8992.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/eb329e6e97a1e8d606d62dd5a81901b6dc0402915ef6de9963bd361817bb8992.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4017655034468852729" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3dde391dcb8f6dd3233c3c72c42593392a8985172785056fb6d57613535ceeac.zip" -> "builds/eb329e6e97a1e8d606d62dd5a81901b6dc0402915ef6de9963bd361817bb8992.zip"
          ~ "timestamp" = "1758788904543711000" -> "1759226155107062200"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2810501753749643978" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788904735435000" -> "1759226154997513000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "53390a627f98810f9eac1e8defdcbd65f3db6808"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:d8466ca1734222a5a8cc22f2afe94b1944de25af13366cf7a814f7dcbb4d2be1" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:d8466ca1734222a5a8cc22f2afe94b1944de25af13366cf7a814f7dcbb4d2be1" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "3cdab5507751cffc8b40ee5bb2a535468c95b685" -> "53390a627f98810f9eac1e8defdcbd65f3db6808"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:c58e4e07f53163d191cde8120cff79b58fe6a07cba2c68e2b0cf7f52adb40c32496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:c58e4e07f53163d191cde8120cff79b58fe6a07cba2c68e2b0cf7f52adb40c32" -> (known after apply)
        name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ repo_digest  = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:f527d3b6ac838ec987e32b1d1e7ee8d19ca8454de4bf94b3ca1d431e0e13f5b4" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "4b2c2a6750dbe82d6281d88e11207ca8f17f5351" -> "b5f9d855bed1e92f44a66b0c7d7fefc7d023f792"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/preprocessor" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:f527d3b6ac838ec987e32b1d1e7ee8d19ca8454de4bf94b3ca1d431e0e13f5b4" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:f527d3b6ac838ec987e32b1d1e7ee8d19ca8454de4bf94b3ca1d431e0e13f5b4" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "4b2c2a6750dbe82d6281d88e11207ca8f17f5351" -> "b5f9d855bed1e92f44a66b0c7d7fefc7d023f792"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2837733083522481683" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788904340758000" -> "1759226155335066000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:d8466ca1734222a5a8cc22f2afe94b1944de25af13366cf7a814f7dcbb4d2be1" -> (known after apply)
      ~ last_modified                  = "2025-09-25T08:31:46.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6838469639858269084" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788904305986000" -> "1759226155319202000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-preprocessor"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:f527d3b6ac838ec987e32b1d1e7ee8d19ca8454de4bf94b3ca1d431e0e13f5b4" -> (known after apply)
      ~ last_modified                  = "2025-09-25T08:32:05.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2341234880365654202" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788904410130000" -> "1759226155335753000"
            # (1 unchanged element hidden)
        }
    }

Plan: 74 to add, 40 to change, 64 to destroy.
module.webgui.terraform_data.cloudfront-version-invalidate: Destroying... [id=6c098afb-c600-72d7-c2bc-64bf4433af7d]
module.webgui.terraform_data.cloudfront-version-invalidate: Destruction complete after 0s
module.webgui.null_resource.cloudfront-invalidate: Destroying... [id=2661903789574527756]
module.webgui.null_resource.cloudfront-invalidate: Destruction complete after 0s
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.webgui.null_resource.s3-upload: Destroying... [id=1243991146218210575]
module.webgui.null_resource.s3-upload: Destruction complete after 0s
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/deidentifyFiles
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: deidentification.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: file_validation.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): zip: adding: launch_ec2.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: creating 'builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip' archive
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): Created: builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/security/lambda/sendSecurityAlert
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: inspector.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] (local-exec): Created: builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: creating 'builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip' archive
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creation complete after 0s [id=442005547269006333]
module.security.module.lambda-sendSecurityAlert.null_resource.archive[0]: Creation complete after 0s [id=2641660899653092298]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip' archive
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/updateFiles
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): Created: builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/error_catcher/lambda/notifyOnError
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): Created: builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 0s [id=5355761814662650321]
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creation complete after 0s [id=6951715028613825004]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creation complete after 0s [id=7668326722839654658]
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].aws_lambda_layer_version.binaries_layer: Creating...
module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=968ac668b4242a0d2998a7e095da42f0df28a483]
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: creating 'builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip' archive
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/lambda/qcNotes
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): Created: builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip
module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0]: Creation complete after 0s [id=50ea96ada19a9c9bc2e6a5c80c1d8ebde29706aa]
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip' archive
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/lambda/sendJobEmail
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created: builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip' archive
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/lambda/batchStarter
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): Created: builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 1s [id=2031261290412892628]
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip' archive
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/lambda/getResultsURL
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Creation complete after 1s [id=1512098067347928268]
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Creation complete after 1s [id=8289957397678506972]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 1s [id=4457772514986272647]
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: creating 'builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip' archive
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getAnalyses
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_filtering_terms.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): zip: adding: route_analyses_id_g_variants.py
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): Created: builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creation complete after 1s [id=5063809583705339277]
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): zip: creating 'builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip' archive
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/customMessageLambdaTrigger/requirements.txt
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=b49a3a880119c6401f8e9348f580dbaa0eeec1f2]
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Creating...
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-a1kskiac
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-a1kskiac
module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 0s [id=7d1f790bcd09b0952c544af0ff23cca1c154bb39]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: creating 'builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip' archive
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/lambda/initFlow
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: lookup.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: pharmcat.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): Created: builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Creation complete after 1s [id=635999529235905379]
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): zip: creating 'builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip' archive
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): Installing python requirements: sbeacon/lambda/generateCohortVCfs/requirements.txt
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-9dskogm0
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-9dskogm0
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: creating 'builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip' archive
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getBiosamples
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_filtering_terms.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_analyses.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_g_variants.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): zip: adding: route_biosamples_id_runs.py
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (local-exec): Created: builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip
module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0]: Creation complete after 0s [id=6158535658807115336]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: creating 'builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip' archive
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getRuns
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_filtering_terms.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_analyses.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): zip: adding: route_runs_id_g_variants.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): Created: builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: creating 'builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip' archive
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/indexer
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: USER_GUIDE.md
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: ctas_queries.py
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creation complete after 1s [id=6799051176614197370]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip' archive
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/performQuery
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_builder.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): zip: adding: query_engine.py
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): Created: builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_index.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_relations.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: generate_query_terms.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-indexer.null_resource.archive[0] (local-exec): Created: builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: creating 'builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip' archive
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getEntryTypes
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Created: builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip
module.sbeacon.module.lambda-indexer.null_resource.archive[0]: Creation complete after 1s [id=3634468932839544216]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creation complete after 1s [id=2670155694871414554]
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creation complete after 1s [id=2916006606932239495]
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 0s [id=638b4d38f85aff1ed96557a56600712931627f8f]
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip' archive
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendClinicJobEmail/requirements.txt
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-i4p6pnjh
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-i4p6pnjh
module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=e15972cfd879ef4f6d76fc9c90f8484a0ce61196]
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: creating 'builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip' archive
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getFilteringTerms
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (local-exec): Created: builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip
module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0]: Creation complete after 1s [id=1595243914681043211]
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: creating 'builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip' archive
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getInfo
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (local-exec): Created: builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.sbeacon.module.lambda-getInfo.null_resource.archive[0]: Creation complete after 0s [id=3745190453442121070]
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: creating 'builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip' archive
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getGenomicVariants
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_biosamples.py
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): zip: adding: route_g_variants_id_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 0s [id=6500091487428938084]
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: creating 'builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getMap
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (local-exec): Created: builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getMap.null_resource.archive[0] (local-exec): Created: builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip
module.sbeacon.module.lambda-getMap.null_resource.archive[0]: Creation complete after 0s [id=8469181751667280095]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0]: Creation complete after 0s [id=5035246295600625909]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip' archive
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/lambda/batchSubmit
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): Created: builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Creation complete after 1s [id=3143150035591530471]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendRegistrationEmail/requirements.txt
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: creating 'builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip' archive
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getProjects
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-0apvz1t5
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-0apvz1t5
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/__init__.py
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): zip: adding: utils/models.py
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (local-exec): Created: builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip
module.sbeacon.module.lambda-getProjects.null_resource.archive[0]: Creation complete after 1s [id=1400511348747614064]
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: creating 'builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip' archive
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/splitQuery
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (local-exec): Created: builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: creating 'builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip' archive
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/sbeacon/lambda/getConfiguration
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-splitQuery.null_resource.archive[0]: Creation complete after 1s [id=6391671705639764685]
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): Created: builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creation complete after 1s [id=8491843732670171520]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0]: Creation complete after 0s [id=0e1288fc3ed188af1a212255c10b66429a3163c1]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/pipeline_lookup/lambda/gnomad
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): Created: builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: creating 'builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/pipeline_lookup/lambda/dbsnp
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): Created: builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Creation complete after 0s [id=1635127007399114420]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Creation complete after 1s [id=8977930535960789350]
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0]: Creating...
module.sbeacon.aws_lambda_layer_version.binaries_layer: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/e802c12402d8e5de28a5bed83831dafe4a6ff02a61127ec28e39e8850f292ee1.zip' archive
module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (local-exec): Collecting PyPDF2==3.0.1 (from -r requirements.txt (line 1))
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/304/default/pgxflow/pipeline_lookup/lambda/updateReferenceFiles
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: dbsnp.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: dbsnp.sh
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.nul
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.